IDEA Open Model
BendData Class
Compatible with IDEA StatiCa Beta 20.0
 Provides data of bend
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.BendData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class BendData
Public Class BendData
The BendData type exposes the following members.
Constructors
Name | Description
BendData
Initializes a new instance of the BendData class
Top
Properties
Name | Description
EndFaceNormal1
 End Face Normal vector
Plate1Id
 First plate
Plate2Id
 Second plate
Point1OfSideBoundary1
 Side boundary first plate point 1
Point1OfSideBoundary2
 Side boundary second plate point 1
Point2OfSideBoundary1
 Side boundary first plate point 2
Point2OfSideBoundary2
 Side boundary second plate point 2
Radius
 Radius of bend
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace